Revit 2026 API

# Transform2DCreateIdentity Method

---

Creates the identity transformation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Transform2D CreateIdentity()
```
```vb
Public Shared Function CreateIdentity As Transform2D
```
```cpp
public:
static Transform2D^ CreateIdentity()
```
```fsharp
static member CreateIdentity : unit -> Transform2D
```

#### Return Value

Transform2D The identity transformation.

The identity transformation does not change a point or a vector that it is applied to.

#### Reference

Transform2D Class

Autodesk.Revit.DB Namespace